<template>
   <div>
      <p class="text-xl font-medium">Пользовательское соглашение</p>
      <p class="text-lg mt-10">{{ text }}</p>
   </div>
</template>

<script setup>
definePageMeta({ layout: 'default' })

const text = `Настоящее Соглашение заключается между ___________ (далее – Владелец) и любым лицом, становящимся после принятия условий данного соглашения пользователем сайта, расположенного в сети Интернет по
         адресу: __________________ (далее – Сайт), в дальнейшем именуемым «Пользователь», вместе по тексту Соглашения именуемые «Стороны», а по отдельности – «Сторона». В соответствии со статьей 435
         Гражданского кодекса РФ настоящее Пользовательское соглашение признается офертой. В соответствии со статьей 438 Гражданского кодекса РФ безусловным принятием (акцептом) условий настоящего
         Соглашения считается факт регистрации на Сайте. Настоящее Соглашение, заключаемое путем акцепта настоящей оферты, не требует двустороннего подписания и действительно в электронном виде. \n 1.
         Термины и определения, используемые в Соглашении\n В Соглашении, если из текста Соглашения прямо не вытекает иное, следующие слова и выражения будут иметь указанные ниже значения: \n 1.1. Сайт –
         совокупность программных и аппаратных средств для ЭВМ, обеспечивающих публикацию для всеобщего обозрения информации и данных, объединенных общим целевым назначением, посредством технических
         средств, применяемых для связи между ЭВМ в сети Интернет. Сайт находится в сети Интернет по адресу: __________________. \n 1.2. Администратор/Владелец Сайта –
         ________________________________________________, расположенное по адресу: ________________________________________________. \n 1.3. Контентом Сайта признаются все объекты, размещенные на Сайте, в
         том числе элементы дизайна, текст, графические изображения, иллюстрации, видео, скрипты, программы, музыка, звуки и другие объекты и их подборки. Владелец Сайта является обладателем
      исключительных прав на использование Сайта, включая весь контент Сайта. \n 1.4. Пользователь – пользователь сети Интернет, в частности Сайта, имеющий свою личную страницу (профиль/аккаунт). \n 1.5.
      Профиль/аккаунт (Профиль) – личная страница Пользователя на Сайте, доступная всем Пользователям Сайта. \n 1.6. Учетная информация – уникальное имя Пользователя (логин) и пароль для входа на Сайт,
      указываемые Пользователем при регистрации на Сайте. \n 1.7. Модерация – просмотр Владельцем Сайта размещаемой (или планируемой к размещению – Премодерация) на Сайте Пользователем информации на
      предмет ее соответствия положениям настоящего Соглашения. \n \n 2. Предмет Соглашения \n 2.1. Владелец Сайта оказывает Пользователю услуги по предоставлению доступа к сервисам Сайта, при этом
      обязательным условием оказания Владельцем Сайта услуг в соответствии с настоящим Соглашением является принятие, соблюдение Пользователем и применение к отношениям Сторон требований и положений,
      определенных настоящим Соглашением. \n 2.2. Владелец Сайта оставляет за собой право изменять условия настоящего Соглашения и всех его неотъемлемых частей без согласования с Пользователем с
      уведомлением последнего посредством размещения на Сайте новой редакции Соглашения или какой-либо его неотъемлемой части, подвергшейся изменениям. Принимая во внимание, что информационная
      рассылка может быть признана Сторонами спамом, Пользователь обязуется не менее одного раза в месяц знакомиться с содержанием Соглашения, размещенного на Сайте, в целях своевременного
      ознакомления с его изменениями. Новая редакция Соглашения и/или какой-либо его неотъемлемой части вступает в силу с момента опубликования на Сайте, если иной срок вступления изменений в силу не
      определен Владельцем Сайта при их опубликовании. Действующая редакция Соглашения и всех приложений к нему всегда находится на Сайте в публичном доступе по адресу:
      ____________________________.\n \n 3. Права и обязанности Владельца Сайта \n 3.1. Владелец Сайта обязуется: \n 3.1.1. Оказывать Пользователю услуги, указанные в пункте 2.1 настоящего Соглашения. Доступ
      к Сайту предоставляется путем присвоения Пользователю Учетной информации в течение 1 (одного) рабочего дня с даты регистрации последнего по адресу __________________. \n 3.1.2. Предоставлять
      Пользователю возможность самостоятельно публиковать информацию о самом себе. \n 3.1.3. Не разглашать третьим лицам Учетную информацию Пользователя. \n 3.1.4. Обеспечивать круглосуточную доступность
      сервера, на котором расположен Сайт, за исключением времени проведения профилактических работ.`
</script>
